# Задача 1
# Найти сумму и произведение цифр трехзначного числа,
# которое вводит пользователь.

# 358 -> 3+5+8 = 16
# 358 -> 3*5*8 = 120

#n = input("трехзначное число: ")

n = '358'
x1 = int(n[0])
x2 = int(n[1])
x3 = int(n[2])
print(f'Сумма чисел = {x1+x2+x3}')
print(f'Произведение чисел = {x1*x2*x3}')

print('________')

n = int('358')
if 0 < n // 100 <= 9:
    a = 358 % 10
    b = (358 // 10) % 10
    c = (358 // 100) % 10
    print(f'Сумма чисел = {a+b+c}\nПроизведение чисел = {a*b*c}')
else:
    print('число не трехзначное')