# Задача 3
# По введенным пользователем координатам двух точек вывести уравнение прямой вида
# y = kx + b, проходящей через эти точки.

# введите координату: 5.5
# введите координату: -1.5
# введите координату: -10
# введите координату: 4
# A(5.5;-1.5) B(-10.0;4.0)
# y = -0.35* x + 0.45

i = 0
a = []
while i < 4:
    a.append(float(input("введите координату: ")))
    i += 1
print(f'A({a[0]};{a[1]}) B({a[2]};{a[3]})')
#k = (y1 - y2) / (x1 - x2)
#b = y2 - k * x2
k = (a[1] - a[3]) / (a[0] - a[2])
b = a[3] - k * a[2]
print(f'y = {k:.2f}* x + {b:.2f}')